# frozen_string_literal: true

# Last updated: 2026-03-19
# vim: ft=ruby

# Build Environment/C/C++
brew 'autoconf'
brew 'automake'
brew 'bash-completion@2'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'direnv'
brew 'fzf'
brew 'gcc'
brew 'glances'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'gpg2'
brew 'jemalloc'
brew 'jq'
brew 'libffi'
brew 'libmemcached'
brew 'libpq'
brew 'libtiff'
brew 'libtool'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'libzip'
brew 'make'
brew 'memcached'
brew 'p7zip'
brew 'parallel'
brew 'pcre'
brew 'pcre'
brew 'pg_top'
brew 'pkg-config'
brew 'postgresql@18'
brew 'pstree'
brew 'pyenv'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'ripgrep'
brew 'rsync'
brew 'ruby-build'
brew 'ruby-completion'
brew 'shellcheck'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yamlfmt'
brew 'yamllint'
brew 'ydiff'
brew 'yq'
brew 'zlib'
brew 'volta'
brew 'v8'

# Rust tools
brew 'fd' # replacement for 'find'
brew 'bat' # replacement for 'cat'
brew 'delta' # replacement for 'git diff'
brew 'git-delta' # replacement for 'git diff'

# Docker tools
brew 'minikube'
brew 'kubernetes-cli'

cask 'chromedriver'

cask 'font-andale-mono'
cask 'font-anonymice-powerline'
cask 'font-arvo'
cask 'font-aurulent-sans-mono-nerd-font'
cask 'font-awesome-terminal-fonts'
cask 'font-bitstream-vera-sans-mono-nerd-font'
cask 'font-blex-mono-nerd-font'
cask 'font-cairo'
cask 'font-cascadia-mono'
cask 'font-consolas-for-powerline'
cask 'font-cousine'
cask 'font-cutive-mono'
cask 'font-d2coding'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-everson-mono'
cask 'font-fantasque-sans-mono'
cask 'font-fontawesome'
cask 'font-ia-writer-mono'
cask 'font-inconsolata'
cask 'font-jetbrains-mono'
cask 'font-kawkab-mono'
cask 'font-lekton-nerd-font'
cask 'font-menlo-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-miriam-mono-clm'
cask 'font-monoid'
cask 'font-monoisome'
cask 'font-mononoki'
cask 'font-monoton'
cask 'font-oswald'
cask 'font-oxygen'
cask 'font-oxygen-mono'
cask 'font-powerline-symbols'
cask 'font-pt-mono'
cask 'font-roboto'
cask 'font-roboto-mono-nerd-font'
cask 'font-share-tech-mono'
cask 'font-sometype-mono'
cask 'font-ubuntu'
cask 'font-victor-mono'
